In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
data = [
    {"name": "Alice", "year": 2020, "sales": 1000},
    {"name": "Bob", "year": 2020, "sales": 1500},
    {"name": "Charlie", "year": 2020, "sales": 1200},
    {"name": "David", "year": 2020, "sales": 800},
    {"name": "Eve", "year": 2020, "sales": 900},
    {"name": "Alice", "year": 2021, "sales": 1100},
    {"name": "Bob", "year": 2021, "sales": 1600},
    {"name": "Charlie", "year": 2021, "sales": 1300},
    {"name": "David", "year": 2021, "sales": 900},
    {"name": "Eve", "year": 2021, "sales": 1000},
    {"name": "Alice", "year": 2022, "sales": 1200},
    {"name": "Bob", "year": 2022, "sales": 1700},
    {"name": "Charlie", "year": 2022, "sales": 1400},
    {"name": "David", "year": 2022, "sales": 1000},
    {"name": "Eve", "year": 2022, "sales": 1100},
    {"name": "Alice", "year": 2023, "sales": 1300},
    {"name": "Bob", "year": 2023, "sales": 1800},
    {"name": "Charlie", "year": 2023, "sales": 1500},
    {"name": "David", "year": 2023, "sales": 1100},
    {"name": "Eve", "year": 2023, "sales": 1200}
]

In [7]:
df = pd.DataFrame(data)
df.head()

      name  year  sales
0    Alice  2020   1000
1      Bob  2020   1500
2  Charlie  2020   1200
3    David  2020    800
4      Eve  2020    900

In [8]:
byName =  df.groupby(['name',"year"]).sum()

In [9]:
byName

              sales
name    year
Alice   2020   1000
        2021   1100
        2022   1200
        2023   1300
Bob     2020   1500
        2021   1600
        2022   1700
        2023   1800
Charlie 2020   1200
        2021   1300
        2022   1400
        2023   1500
David   2020    800
        2021    900
        2022   1000
        2023   1100
Eve     2020    900
        2021   1000
        2022   1100
        2023   1200

In [12]:
s1 =  byName.loc["Alice"]
s2 = byName.loc["Bob"]

In [14]:
s1.compare(s2)

     sales
      self other
year
2020  1000  1500
2021  1100  1600
2022  1200  1700
2023  1300  1800

In [5]:
df = pd.read_csv("./datasets/pizza_delivery.csv")

In [7]:
df.head()

,day,date,time,operator,branch,driver,temperature,bill,pizzas,free_wine,got_wine,discount_customer
0,Thursday,01-May-14,35.128367,Laura,East,Bruno,68.287716,58.4,4,0,0,1
1,Thursday,01-May-14,25.203074,Melissa,East,Salvatore,70.997791,26.4,2,0,0,0
2,Thursday,01-May-14,45.643404,Melissa,West,Salvatore,53.394145,58.1,3,1,0,0
3,Thursday,01-May-14,29.374298,Melissa,East,Salvatore,70.306596,35.2,3,0,0,0
4,Thursday,01-May-14,29.994610,Melissa,West,Salvatore,71.501688,38.4,2,0,0,0

In [8]:
df.groupby(["driver","branch"]).bill.sum().unstack()

branch     Centre    East    West
driver
Bruno      6346.9  3083.4  5254.4
Domenico    589.1  1766.3   740.4
Luigi      1980.6  2204.9  1645.5
Mario      5157.0  4805.0  5402.6
Salvatore  5757.8  3204.6  6190.5

In [9]:
df.groupby("driver").bill.transform(lambda x : x - x.mean())

0       13.765653
1      -17.649128
2       14.050872
3       -8.849128
4       -5.649128
          ...
1261     3.782123
1262    -1.288172
1263     4.636620
1264    -5.049128
1265    -1.934347
Name: bill, Length: 1266, dtype: float64

In [10]:
df.groupby("driver").bill.apply(lambda x : x - x.mean())

driver
Bruno      0       13.765653
           5       17.165653
           6       13.265653
           9        0.165653
           10       4.865653
                     ...
Salvatore  1253     4.450872
           1254    -5.149128
           1255     8.850872
           1259    -4.049128
           1264    -5.049128
Name: bill, Length: 1266, dtype: float64

___

In [11]:
df2 = pd.read_excel("./datasets/stocks.xlsx", header=[0,1], index_col=0)

In [12]:
df2.head()

              Price                  Price to earnings ratio (P/E)         \
Company    Facebook Google Microsoft                      Facebook Google
2017-06-05      155    955        66                         37.10   32.0
2017-06-06      150    987        69                         36.98   31.3
2017-06-07      153    963        62                         36.78   31.7
2017-06-08      155   1000        61                         36.11   31.2
2017-06-09      156   1012        66                         37.07   30.0


Company    Microsoft
2017-06-05     30.31
2017-06-06     30.56
2017-06-07     30.46
2017-06-08     30.11
2017-06-09     31.00

In [13]:
df2_stacked =  df2.stack()
df2_stacked

                      Price  Price to earnings ratio (P/E)
           Company
2017-06-05 Facebook     155                          37.10
           Google       955                          32.00
           Microsoft     66                          30.31
2017-06-06 Facebook     150                          36.98
           Google       987                          31.30
           Microsoft     69                          30.56
2017-06-07 Facebook     153                          36.78
           Google       963                          31.70
           Microsoft     62                          30.46
2017-06-08 Facebook     155                          36.11
           Google      1000                          31.20
           Microsoft     61                          30.11
2017-06-09 Facebook     156                          37.07
           Google      1012                          30.00
           Microsoft     66                          31.00

In [14]:
df2_stacked.sum()

Price                            6010.00
Price to earnings ratio (P/E)     492.68
dtype: float64

In [35]:
arrays = [[1, 1, 2, 2,3], 
          ['red', 'blue', 'red', 'blue',"green"], 
          ["win","loose","loose","win","loose"]]

In [36]:
df2.index

DatetimeIndex(['2017-06-05', '2017-06-06', '2017-06-07', '2017-06-08',
               '2017-06-09'],
              dtype='datetime64[ns]', freq=None)

In [37]:
mindex =  pd.MultiIndex.from_arrays(arrays, names=("number","color","tag"))

In [38]:
mindex.names

FrozenList(['number', 'color', 'tag'])

In [39]:
mindex.nlevels

3

In [40]:
mindex.levshape

(3, 3, 2)

In [41]:
mindex.dtype

dtype('O')

In [47]:
df2_stacked.index.names =["Date","Company"]

In [54]:
df2_stacked.loc["2017-06-05"]

           Price  Price to earnings ratio (P/E)
Company
Facebook     155                          37.10
Google       955                          32.00
Microsoft     66                          30.31